In [1]:
import mysql.connector as sql
import pandas as pd

In [2]:
#this seems to work
con = sql.connect(user='zacharyclement', password='Snowboard42##',
                              host='127.0.0.1',
                              database='world')

In [3]:
cursor = con.cursor()

In [4]:
query = ('SELECT * From city')

In [5]:
cursor.execute(query)

In [6]:
table_rows = cursor.fetchall()

In [7]:
df = pd.DataFrame(table_rows)

In [8]:
df.head()

   0               1    2              3        4
0  1           Kabul  AFG          Kabol  1780000
1  2        Qandahar  AFG       Qandahar   237500
2  3           Herat  AFG          Herat   186800
3  4  Mazar-e-Sharif  AFG          Balkh   127800
4  5       Amsterdam  NLD  Noord-Holland   731200

In [171]:
result = posts.insert_one(post_data)

In [174]:
print 'One post:{0}'.format(result.inserted_id)

One post:5aeb5f1da91d5922841b2f9b